Strömungssimulation/cylinderRe20/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }
    outlet
    {
        type        totalPressure;
	rho	    none;
        p0	    uniform 0;
        value       uniform 0;
    }
    top
    {
        type        zeroGradient;
    }
    bottom
    {
        type        zeroGradient;
    }
    obstacle
    {
        type        zeroGradient;
    }
    frontAndBack
    {
        type        empty;
    }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
