Strömungssimulation/cylinderRe20/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
	
type                fieldAverage;
libs                ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields
(
    U
    {
	mean            on;
	prime2Mean      on;
	base            time;
    }
    p
    {
	mean            on;
	prime2Mean      on;
	base            time;
    }
);
// ************************************************************************* //
